---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipeSize
source: html/ff6df064-7a74-9f4c-1185-37ee54f9ac96.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipeSize Property

Pipe Size, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipeSize { get; }
```